phase0-checks/fio_nvme.log
seqread: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
fio-3.36
Starting 1 process
seqread: Laying out IO file (1 file / 2048MiB)

seqread: (groupid=0, jobs=1): err= 0: pid=115140: Mon May 25 19:04:09 2026
  read: IOPS=4816, BW=4817MiB/s (5050MB/s)(94.1GiB/20001msec)
    slat (usec): min=101, max=1203, avg=178.96, stdev=56.22
    clat (usec): min=201, max=12396, avg=3141.13, stdev=550.67
     lat (usec): min=443, max=13294, avg=3320.09, stdev=580.92
    clat percentiles (usec):
     |  1.00th=[ 2114],  5.00th=[ 2376], 10.00th=[ 2573], 20.00th=[ 2802],
     | 30.00th=[ 2900], 40.00th=[ 2966], 50.00th=[ 3032], 60.00th=[ 3130],
     | 70.00th=[ 3228], 80.00th=[ 3621], 90.00th=[ 3851], 95.00th=[ 3982],
     | 99.00th=[ 4424], 99.50th=[ 5080], 99.90th=[ 7373], 99.95th=[ 9503],
     | 99.99th=[11994]
   bw (  MiB/s): min= 4328, max= 5156, per=100.00%, avg=4822.29, stdev=178.00, samples=39
   iops        : min= 4328, max= 5156, avg=4822.18, stdev=177.99, samples=39
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.12%, 4=95.07%, 10=4.77%, 20=0.04%
  cpu          : usr=0.86%, sys=88.28%, ctx=40779, majf=0, minf=4106
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=96335,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=4817MiB/s (5050MB/s), 4817MiB/s-4817MiB/s (5050MB/s-5050MB/s), io=94.1GiB (101GB), run=20001-20001msec

Disk stats (read/write):
  nvme0n1: ios=761467/293, sectors=194935552/27208, merge=0/624, ticks=1520006/599, in_queue=1520612, util=68.30%